In [2]:
import numpy as np
import pandas as pd

In [8]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Recep"],
            "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
            "Kalori" : [100,200,300,400]
           }

In [9]:
dataFrame1 = pd.DataFrame(sozluk1, index = [0,1,2,3])

In [10]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3   Recep  Basketbol     400

In [11]:
sozluk2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"],
            "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
            "Kalori" : [200,100,50,300]
           }

In [12]:
dataFrame2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [13]:
sozluk3 = {"Isim" : ["Ayse","Mahmut","Durgu","Nur"],
            "Spor" : ["Koşu","Yüzme","Badminto","Tenis"],
            "Kalori" : [300,400,500,250]
           }

In [14]:
dataFrame3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [15]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [16]:
dataFrame3

      Isim      Spor  Kalori
8     Ayse      Koşu     300
9   Mahmut     Yüzme     400
10   Durgu  Badminto     500
11     Nur     Tenis     250

## concatenation (birlestirme)

In [18]:
pd.concat([dataFrame1,dataFrame2,dataFrame3], axis = 0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3    Recep  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Durgu   Badminto     500
11     Nur      Tenis     250

## merge (kaynastırmak gibi)

In [27]:
mergeSozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Recep"],
                "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]
               }

In [28]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [29]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3   Recep  Basketbol

In [30]:
mergeSozluk2 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Recep"],
                "Kalori" : [100,200,250,150]
               }

In [31]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [32]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     250
3   Recep     150

In [34]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on = "Isim") # ortak alanı "on" diyip belirtiyoruz

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     250
3   Recep  Basketbol     150

In [35]:
maasSozluk = {"Isimler" : ["Recep","Zeynep","Mehmet","Ahmet"],
              "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas" : [200,300,400,500]
             }

In [36]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [37]:
maasDataFrame

  Isimler  Departman  Maas
0   Recep    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [40]:
maasDataFrame["Departman"].unique() # tekil olanları getir

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [42]:
maasDataFrame["Departman"].nunique() # tekil olanların sayısını getir, kaç tane var yani

3

In [44]:
maasDataFrame["Departman"].value_counts() # hangi departmandan kaç tane isnan odlduğu

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [49]:
def bruttenNete(maas):
    return maas * 0.66

In [50]:
maasDataFrame["Maas"].apply(bruttenNete) # yukarıdaki fonksiyonu ekledik

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [52]:
maasDataFrame.isnull() # null değer var mı

   Isimler  Departman   Maas
0    False      False  False
1    False      False  False
2    False      False  False
3    False      False  False

## pivot

In [57]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park","South Park","Simpson","Simpson","Simpson"],
               "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart","Bart"],
               "Karakter Yas" : [9,10,50,20,10]
              }

In [58]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [59]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [61]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı","Karakter Ismi"],aggfunc=np.sum)#Bartları topladı

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10